configuration.org
#+TITLE: Semacs Configuration
#+AUTHOR: Vsevolod Prudius | Sobaka Dev
#+EMAIL: i@sevap.ru
#+DATE: Friday, May 30, 2025
#+PROPERTY: header-args:emacs-lisp :results silent


* Introduction

This document organizes and automatically generates the Emacs
configuration based on experience I had at MLPrograms. Now you cannot
find this company anymore. As well as any other things in life, it was
temporary and after 6 years, it was closed and consumed by OpenGI.
But we're here for the different reason, for emacs, right?

The [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-File.html][configuration file]], typically =~/.emacs.d/init.el=, can be used to
add UI customizations, functionalities, or settings not found in Emacs
out-of-the-box. Organizing our configuration file in an =org-mode=
narrative improves organization and readability. More importantly, it
facilitates more rigorous documentation.

Above all else, the goal of this narrative is to explain each line of our
configuration file and why it is needed from my perspective.

Our configuration file aims to adhear to several principles:
  + Pretty :: cleanly written, clearly explained
  + Lean :: preference to packages that play well with builtin packages
  + Consistent :: experience should be as stable as possible, for as many
    languages as possible
  + Tramp-friendly :: packages must integrate well with tramp as ssh
    connections are crucial

Some part of text elements and code blocks here were written by Jon
Harris or Baran Iscanli. I appreciate their work and believe in their
bright future (as well as intellectual rights on some part of this
configuration)

* Default Init File

To configure Emacs using this narrative, we must instruct Emacs to do so in the
=init.el= file (credit: [[https:https://ryan.himmelwright.net/post/org-babel-setup/][Ryan Himmelwright]]). At a minimum, the =init.el= file must
contain the =emacs-lisp= code in the example below. By loading this narrative,
Emacs will configure itself by executing the =emacs-lisp= code blocks; code in
other languages or have ~:tangle no~ will not be exported to the new =.el= file..

While it is possible to include other configuration instructions in the =init.el=
file, it is more convenient to have everything in this centralized document.

You can check init.el file here

* Emacs Literate Configuration
** Startup Performance
*** Garbage collection

[[https://www.techtarget.com/searchstorage/definition/garbage-collection][Garbage collection]] (GC) ensures that a program does not exceed its memory quota
or reach a point that it can no longer function. It also frees up developers
from having to manually manage a program's memory, which, in turn reduces the
potential for memory-related bugs.

*** Perform GC while idling

It is recommended that we perform garbage collection when not actively using
Emacs. Therefore, we perform GC if idle for 30 seconds.(credit: [[https://emacs.stackexchange.com/questions/34342/is-there-any-downside-to-setting-gc-cons-threshold-very-high-and-collecting-ga][StackExchange]])

#+begin_src emacs-lisp
  ;; idle garbage collecting
  (run-with-idle-timer 30 t (lambda () (garbage-collect)))
#+end_src

** System Management
*** Keep .Emacs.d Tidy

The package [[https://github.com/emacscollective/no-littering][no-littering]] is useful for standardizing default paths used to
store files across Emacs packages. This package creates descriptive file names
and subdirectories when appropriate.

#+begin_src emacs-lisp
;; keep .emacs.d clean
(use-package no-littering
  :demand t)
#+end_src

*** Move Automatic Customization to Separate File

Emacs packages may automatically generate customization, which are then stored
at the bottom of the =init.el= config file. To prevent the additional clutter, we
move these customizations to a separate =automatic-settings.el= file.

#+begin_src emacs-lisp
;; keep customization settings in a temporary file (skip loading for speed)
(setq custom-file "~/.emacs.d/automatic-settings.el")
;; (when (file-exists-p custom-file)
;;   (load custom-file))
#+end_src

** Basic UI Modifications
*** Remove UI Elements

If you open Emacs without configurations, you will be bombarded with a start-
and splash-screens, scratch messages, and other unwanted elements. The
following snippet removes these elements from the GUI and replaces the initial
scratch message when you first open Emacs.

#+begin_src emacs-lisp
  ;; suppress noise on startup
  (setq-default inhibit-startup-screen t
                inhibit-splash-screen t
                initial-scratch-message ";;Hope you have a good day!
  ")

  ;; remove unwanted elements
  (menu-bar-mode 0)   ; disable the menu bar at the top
  (when (boundp 'x-toolkit-scroll-bars)
    (scroll-bar-mode 0))
   ; disable visible scrollbar
  (scroll-all-mode 0) ; disable synchronized scrolling of buffers
  (tool-bar-mode 0)   ; disable the toolbar
  (tooltip-mode 0)    ; disable the tooltip

  ;; But let's keep horizontal scroll-bar
  (use-package mlscroll
    :defer t
    :config (mlscroll-mode))
#+end_src

*** Set Indentation Style

Emacs comes with a default indentation style that is not desirable. Here, we
define the indentation style for [[https://www.gnu.org/software/emacs/manual/html_node/ccmode/][CC Mode]] and set the basic offset to =4= (credit:
[[https://stackoverflow.com/questions/37105356/change-tab-width-in-emacs][StackOverflow]]); [[https://www.emacswiki.org/emacs/IndentingC][emacswiki]] contains an example of the change. Additionally, we
modify the standard indent and tab behavior. Finally, TeX files ignores tabs,
so we want to prevent using TAB to add multiple spaces when formatting a region
(credit: [[https://www.gnu.org/software/emacs/manual/html_node/eintr/Indent-Tabs-Mode.html][gnu.org]])

#+begin_src emacs-lisp
;; set indentation style for CC mode
(require 'cc-styles)

(setq c-default-style "linux"
      c-basic-offset 4
      tab-width 4)

;; set indentation for enriched text
(setq-default standard-indent 4)

;; use tab for auto-complete selection
;;(setq-default tab-always-indent 'complete)

;; prevent extraneous tabs -- affects TeX
(setq-default indent-tabs-mode nil)
#+end_src

*** Tidy White Spaces

It is a good idea to minimize the number of empty whitespaces in software
files. We use the package [[https://www.emacswiki.org/emacs/WhiteSpace][Whitespace]], which is a minor mode to visualize white
spaces (duh). The following snippet defines a number of settings and custom
functions to visual white spaces and cleanup white spaces on saving the file.

#+begin_src emacs-lisp
;; package is minor mode to visualize white spaces
(require 'whitespace)
(setq-default indicate-empty-lines t)
(setq whitespace-line-column 79
      whitespace-style '(face trailing lines-tail empty
                              indentation::space space-before-tab::tab))
(global-whitespace-mode 0)

;; cleanup  whitespaces on save
(defcustom do-whitespace-cleanup t
  "Perform 'whitespace-cleanup' on save."
  :group 'whitespace)

(make-variable-buffer-local 'do-whitespace-cleanup)

(defun toggle-whitespace-cleanup ()
  "Turn the 'whitespace-cleanup' hook on and off."
  (interactive)
  (setq do-whitespace-cleanup (not do-whitespace-cleanup))
  (message "do-whitespace-cleanup set to %s" do-whitespace-cleanup))

(add-hook 'before-save-hook
          (lambda ()
            (when do-whitespace-cleanup
              (whitespace-cleanup))))

;; dont cleanup whitespace but do delete trailing whitespace
(add-hook 'makefile-mode-hook
          (lambda ()
            (setq indent-tabs-mode t
                  do-whitespace-cleanup nil)
            (add-hook 'before-save-hook #'delete-trailing-whitespace)))

(add-hook 'prog-mode-hook (lambda () (whitespace-mode +1)))
#+end_src

*** Visual Cues

Visual cues are useful for locating the cursor or parentheses pairs.

#+begin_src emacs-lisp
;; add visual bell (removes audible dinging)
(setq visible-bell t)

;; flash location of cursor when moved
(use-package beacon
  :defer 2
  :config (beacon-mode 1))

;; paired parentheses
(electric-pair-mode 1)

;; highlight matching parentheses
(show-paren-mode 1)
(setq-default show-paren-style 'parenthesis
              show-paren-when-point-in-periphery t)
#+end_src

** Theming
*** Theme

Dark themes are shown to improve text legibility, reduce eye strain, improve
concentration, and reduce circadian-disrupting blue light ([[https://www.wired.co.uk/article/dark-mode-chrome-android-ios-science][wired.uk]]). However,
it may be difficult for others to see text when video sharing during a
conference call.

The following snippet makes it easy to switch between selected dark and light
themes.

#+begin_src emacs-lisp
;; download your desired themes here
(use-package solarized-theme :defer t)

;; use to make sure themes are switched correctly
(defun disable-all-themes ()
  "Disable all active themes."
  (dolist (i custom-enabled-themes)
    (disable-theme i)))

(defadvice load-theme (before disable-themes-first activate)
  "Disable current theme(s) before loading a new one."
  (disable-all-themes))

(defun light ()
  "Turn on light theme."
  (interactive)
  (load-theme 'dichromacy t))

;; make a little darker for higher contrast and darklight org src blocks
(defun dark ()
  "Turn on dark theme."
  (interactive)
  (load-theme 'solarized-zenburn t))

(light)
#+end_src

*** Font

The custom function below makes it easy to change the size of your font.

#+begin_src emacs-lisp
(defun fonts (fontsize)
  "Set FONTSIZE."
  (interactive "nFont size: ")
  ;; font for unicode characters
  (let ((font "Symbola")
        (size fontsize))
    (when (member font (font-family-list))
      (let ((fontspec (format "%s %d" font size)))
        (set-fontset-font t 'unicode fontspec nil 'prepend)
        (message fontspec))))

  ;; general editor font
  (let ((font "Noto Sans Mono")
        (size fontsize))
    (when (member font (font-family-list))
      (let ((fontspec (format "%s %d" font size)))
        (set-frame-font fontspec nil t)
        (add-to-list 'default-frame-alist `(font . ,fontspec))
        ;; (set-face-attribute 'default (selected-frame) :height 90)
        ;; (set-face-attribute 'default nil :height 100)
        (message fontspec)))))
(fonts 15)
#+end_src

*** Line Numbers

#+begin_src emacs-lisp
;; show column number in modeline
(column-number-mode t)

;; uncomment to turn on line numbers everywhere
;; (global-display-line-numbers-mode t)

;; display line numbers only in prog-mode by default
(add-hook 'prog-mode-hook 'display-line-numbers-mode)

;; scale line numbers with text size
(defun linum-scale (arg)
  (interactive "nScale: ")
  (set-face-attribute 'line-number nil :inherit nil :height arg))
#+end_src

