configuration.el
;; idle garbage collecting
(run-with-idle-timer 30 t (lambda () (garbage-collect)))

;; keep .emacs.d clean
(use-package no-littering)

;; keep customization settings in a temporary file
(setq custom-file "~/.emacs.d/automatic-settings.el")
(when (file-exists-p custom-file)
  (load custom-file))

;; suppress noise on startup
(setq-default inhibit-startup-screen t
              inhibit-splash-screen t
              initial-scratch-message ";;Hope you have a good day!
")

;; remove unwanted elements
(menu-bar-mode 0)   ; disable the menu bar at the top
(when (boundp 'x-toolkit-scroll-bars)
  (scroll-bar-mode 0))
 ; disable visible scrollbar
(scroll-all-mode 0) ; disable synchronized scrolling of buffers
(tool-bar-mode 0)   ; disable the toolbar
(tooltip-mode 0)    ; disable the tooltip

;; set indentation style for CC mode
(require 'cc-styles)

(setq c-default-style "linux"
      c-basic-offset 4
      tab-width 4)

;; set indentation for enriched text
(setq-default standard-indent 4)

;; use tab for auto-complete selection
;;(setq-default tab-always-indent 'complete)

;; prevent extraneous tabs -- affects TeX
(setq-default indent-tabs-mode nil)

;; package is minor mode to visualize white spaces
(require 'whitespace)
(setq-default indicate-empty-lines t)
(setq whitespace-line-column 79
      whitespace-style '(face trailing lines-tail empty
                              indentation::space space-before-tab::tab))
(global-whitespace-mode 0)

;; cleanup  whitespaces on save
(defcustom do-whitespace-cleanup t
  "Perform 'whitespace-cleanup' on save."
  :group 'whitespace)

(make-variable-buffer-local 'do-whitespace-cleanup)

(defun toggle-whitespace-cleanup ()
  "Turn the 'whitespace-cleanup' hook on and off."
  (interactive)
  (setq do-whitespace-cleanup (not do-whitespace-cleanup))
  (message "do-whitespace-cleanup set to %s" do-whitespace-cleanup))

(add-hook 'before-save-hook
          (lambda ()
            (when do-whitespace-cleanup
              (whitespace-cleanup))))

;; dont cleanup whitespace but do delete trailing whitespace
(add-hook 'makefile-mode-hook
          (lambda ()
            (setq indent-tabs-mode t
                  do-whitespace-cleanup nil)
            (add-hook 'before-save-hook #'delete-trailing-whitespace)))

(add-hook 'prog-mode-hook (lambda () (whitespace-mode +1)))

;; add visual bell (removes audible dinging)
(setq visible-bell t)

;; flash location of cursor when moved
(use-package beacon
  :config (beacon-mode 1))

;; paired parentheses
(electric-pair-mode 1)

;; highlight matching parentheses
(show-paren-mode 1)
(setq-default show-paren-style 'parenthesis
              show-paren-when-point-in-periphery t)

;; download your desired themes here
(use-package solarized-theme :defer t)

;; use to make sure themes are switched correctly
(defun disable-all-themes ()
  "Disable all active themes."
  (dolist (i custom-enabled-themes)
    (disable-theme i)))

(defadvice load-theme (before disable-themes-first activate)
  "Disable current theme(s) before loading a new one."
  (disable-all-themes))

(defun light ()
  "Turn on light theme."
  (interactive)
  (load-theme 'dichromacy t))

;; make a little darker for higher contrast and darklight org src blocks
(defun dark ()
  "Turn on dark theme."
  (interactive)
  (load-theme 'solarized-zenburn t))

(light)

(defun fonts (fontsize)
  "Set FONTSIZE."
  (interactive "nFont size: ")
  ;; font for unicode characters
  (let ((font "Symbola")
        (size fontsize))
    (when (member font (font-family-list))
      (let ((fontspec (format "%s %d" font size)))
        (set-fontset-font t 'unicode fontspec nil 'prepend)
        (message fontspec))))

  ;; general editor font
  (let ((font "Noto Sans Mono")
        (size fontsize))
    (when (member font (font-family-list))
      (let ((fontspec (format "%s %d" font size)))
        (set-frame-font fontspec nil t)
        (add-to-list 'default-frame-alist `(font . ,fontspec))
        ;; (set-face-attribute 'default (selected-frame) :height 90)
        ;; (set-face-attribute 'default nil :height 100)
        (message fontspec)))))
(fonts 10)

;; show column number in modeline
(column-number-mode t)

;; uncomment to turn on line numbers everywhere
;; (global-display-line-numbers-mode t)

;; display line numbers only in prog-mode by default
(add-hook 'prog-mode-hook 'display-line-numbers-mode)

;; scale line numbers with text size
(defun linum-scale (arg)
  (interactive "nScale: ")
  (set-face-attribute 'line-number nil :inherit nil :height arg))
