configuration.org
*** Highlighting

#+begin_src emacs-lisp
;; highlight occurences of the same thing in buffer
(use-package highlight-thing
  :defer t
  :hook ((prog-mode . highlight-thing-mode)
         (org-mode . highlight-thing-mode))
  :config
  (setq highlight-thing-exclude-thing-under-point t
        highlight-thing-case-sensitive-p t
        highlight-thing-ignore-list
        '("False" "True", "return", "None", "if", "else", "self",
          "import", "from", "in", "def", "class")))

;; comment out to remove highlighting on line containing point
(global-hl-line-mode)
#+end_src

*** Name of Frame
#+begin_src emacs-lisp
;; change frame title to buffer name
(setq frame-title-format
      '("emacs: " (:eval (if (buffer-file-name)
                             (abbreviate-file-name (buffer-file-name)) "%b"))))
#+end_src

*** Line Wrapping

#+begin_src emacs-lisp
;; enable line wrapping (otherwise will continue outside buffer)
(global-visual-line-mode 1)
#+end_src

*** Enable Lazy Prompting

We are lazy. We do not want to type "yes" or "no" responses.

#+begin_src emacs-lisp
;; lazy prompting
(fset 'yes-or-no-p 'y-or-n-p)
#+end_src

*** Calendar Style and Formatting

The following snippet changes how the calendar is generally structured and
displayed.

#+begin_src emacs-lisp
  ;; calendar settings
  (setq-default
   european-calendar-style t
   calendar-date-style 'european
   calendar-week-start-day 1

   display-time-24hr-format t
   display-time-day-and-date t
   display-time-string-forms
   '((if (and (not display-time-format) display-time-day-and-date)
         (format-time-string "%a %b %e " now) "")
     (format-time-string (or display-time-format
                             (if display-time-24hr-format "%H:%M" "%-I:%M%p"))
                         now))
   calendar-time-display-form
   '(24-hours ":" minutes
              (if time-zone " (") time-zone (if time-zone ")"))
   )
  (setq calendar-latitude 52.36547
        calendar-longitude 4.81926
        calendar-location-name "Amsterdam"
        calendar-time-zone 60)
 
#+end_src

*** Buffer Formatting

We define several configurations used across all buffers, and includes:
  - debug setting :: ignore Lisp errors
  - structural settings :: controls dimensions of column, paragraph
    indentation, and message logs
  - backup settings :: To minimize memory consumption, we enable
    version-control and automatic deletions, and control the number of backups
    stored for any file
  - edit settings :: control how windows are split between file versions
  - ibuffer settings :: [[https:https://www.emacswiki.org/emacs/IbufferMode][ibuffer]] is default Emacs package that provides a list
    of buffers (~C-x b~). Here, we control the display of the ibuffer window and
    add shell command functionality.
  - auto-complete settings :: ignore case in minibuffer

#+begin_src emacs-lisp
;; misc. buffer settings
(winner-mode 1)   ;; undo/redo window configurations

(setq-default
 ;; debug setting
 debug-on-error nil

 ;; structure settings
 fill-column 100
 message-log-max 2000

 sentence-end-double-space nil
 indicate-empty-lines t

 ;; backup settings
 delete-old-versions t
 kept-new-versions 6
 kept-old-versions 2
 version-control t
 vc-make-backup-files t
 backup-directory-alist '((".*" . "~/.emacs.d/emacs-backups"))

 ;; ediff settings
 ediff-split-window-function 'split-window-horizontally
 ediff-window-setup-function 'ediff-setup-windows-plain

 ;; ibuffer settings
 ibuffer-use-other-window t
 ibuffer-formats
 '((mark modified read-only locked
         " " (name 36 36 :left :elide)
         " " (size 9 -1 :right)
         " " (mode 16 16 :left :elide) " " filename-and-process)
   (mark " " (name 16 -1) " " filename))

 async-shell-command-buffer 'new-buffer
 display-buffer-alist '(("*Async Shell Command*" . (display-buffer-no-window)))
 ibuffer-maybe-show-predicates
 `(,(lambda (buf)
      (or (and (string-match "^ " (buffer-name buf))
               (null buffer-file-name))
          (string-match ".*Async Shell Command.*" (buffer-name buf)))))

 ;; auto-complete settings
 read-buffer-completion-ignore-case t
 read-file-name-completion-ignore-case t
 )
#+end_src

*** Save Passwords to GPG File

It is a bad idea to save your sudo passwords in a plain text file. Instead, we
save sudo passwords as a [[https://docs.fileformat.com/misc/gpg/#:~:text=Extracting%20a%20File-,What%20is%20a%20GPG%20file%3F,is%20also%20known%20as%20PGP.][GPG]] encryption file.

#+begin_src emacs-lisp
;; prevent storage of sudo passwords in plaintext
(setq-default
 auth-sources '("~/.emacs.0/.authinfo.gpg")
 auth-source-save-behavior nil
 )
#+end_src

*** Documentation Man Page Setting

The [[https:https://www.gnu.org/software/emacs/manual/html_node/emacs/Man-Page.html][manual page]] (=man page= for short) is the main form of in-line documentation
on Unix. Emacs organizes these manuals and ~M-x man~ accesses the man page for an
operating system command, library function or system call.

The following snippet defines the width of the page and makes the manpage the
current buffer in the current window.

#+begin_src emacs-lisp
;; man page settings
(setq-default
 Man-width 100
 Man-notify-method 'pushy
 )
#+end_src


*** Helpful

[[https://github.com/Wilfred/helpful][Helpful]] improves accessing, reading, and contextualizing Emacs documentation.

#+begin_src emacs-lisp
;; alternative to built-in Emacs help
(use-package helpful
  :defer t
  :bind (("C-h j" . helpful-at-point)
         ("C-h f" . helpful-callable)
         ("C-h v" . helpful-variable)
         ("C-h k" . helpful-key)
         ("C-c C-d" . helpful-at-point)
         ("C-h F" . helpful-function)))
#+end_src

*** Mouse Yanking

By default, ~mouse-2~ (right click) may move the point. When using the mouse (*you
shouldn't*), prevent ~mouse-2~ (right click) from moving the point. Additionally,
yanking/pasting will occur at point, not where you clicked on the screen.

#+begin_src emacs-lisp
;; paste at point, not location of mouse cursor
(setq-default mouse-yank-at-point t)
#+end_src

*** Host and Server Connections

At MLP (and most companies in general), data and code were stored on servers
instead of individual work laptops. The following snippet ensures that the
=~/.ssh/config= contains hosts corresponding to servers.

*Note:* Make sure to =mkdir -p ~/.ssh/control=, otherwise there will be errors.

*Note:* The custom variable =personal-hosts= contains the names of servers currently
used. This was previously defined manually, which requires us to
manually add new names as MLP uses more servers (see commented out line).
Instead, =personal-hosts= has been updated to automatically search for servers on the
=.ssh=.

#+begin_src emacs-lisp
;; connect to server
(defun connect-server (server env)
  "Connect (via ssh/TRAMP) to SERVER and use the ENV python virtualenv.
This sets your default directory to live on SERVER. Call `M-x local` to move
back to the local machine. Note: if you don't use ssh host abbreviations, you
can also use ie. user@sevap.ru as SERVER."
  (interactive "sServer:
sVirtualenv (name of directory inside ~/.virtualenvs):")
  (setq default-directory (concat "/ssh:" server ":")
        shell-file-name "/bin/bash"
        python-shell-virtualenv-root (concat "~/.virtualenvs/" env)))

;; create default directory
(defun local ()
  "Set default directory back to local, remove (potentially remote) virtualenv."
  (interactive)
  (setq default-directory "~/"
        python-shell-virtualenv-root nil))

;; variable contains list of servers used
(defvar personal-hosts '("tete", "titty"))
#+end_src

** TRAMP

[[https://www.gnu.org/software/tramp/][TRAMP]] (Transparent Remote Access, Multiple Protocols) is a package for
accessing remote files. This allows us to manipulate files as if they were on
our local machine.

#+begin_src emacs-lisp
;; tramp
(eval-after-load "tramp"
  `(setq tramp-default-method "ssh"
         password-cache-expiry nil
         remote-file-name-inhibit-cache nil
         tramp-completion-reread-directory-timeout nil
         tramp-use-ssh-controlmaster-options nil
         tramp-ssh-controlmaster-options
         (concat "-o ControlPath=~/.ssh/control/%%r@%%h:%%p "
                 "-o ControlMaster=auto "
                 "-o ControlPersist=yes ")))

(require 'tramp)
#+end_src

** Files and Encoding
*** Set Language Environment

[[https://blog.hubspot.com/website/what-is-utf-8][UTF-8]] is central to the storage and encoding of text and files. Although other
encoding systems exist, =utf-8= is practically a standard, at least in the West,
and so it is important that we instruct Emacs to treat files as UTF-8 by
default (credit: [[https://www.masteringemacs.org/article/working-coding-systems-unicode-emacs][MasteringEmacs]]).

#+begin_src emacs-lisp
;; set language environment
(set-language-environment "UTF-8")
(setq uniquify-buffer-name-style 'forward
      locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(when (display-graphic-p)
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
#+end_src

*** Auto-Revert Reloaded Images

The following snippet enables Emacs to open graphic files and automatically
updates the buffer if the image changes.

#+begin_src emacs-lisp
;; auto-revert reloaded images
(auto-image-file-mode 1)
(add-hook 'image-mode-hook 'auto-revert-mode)
#+end_src

** Emacs Client

Emacs has the capability of running in a server mode which allows us to have a
persistent session in Emacs that "lives" across different instances of frames
that you open in Emacs (credit: [[https://www.youtube.com/watch?v=ZjCRxAMPdNc][SystemCrafters]]). This is advantageous for
several reasons:
  + Start Emacs only once :: avoid slow startup each time you open a new window
  + Buffers persist across frames :: can open later if we close Emacs window

[[https:https://www.emacswiki.org/emacs/EmacsClient][Emacs Client]] is a streamlined version of Emacs that quickly opens an Emacs GUI
instance and connects directly to Emacs server. Systemd is a Linux services
manager that starts a bunch of services in parallel when your laptop boots up.

#+begin_src emacs-lisp
;; allows for use of emacsclient
(require 'server)
(unless (server-running-p)
  (server-start))
#+end_src

** Auto-Completion
