configuration.el

;; highlight occurences of the same thing in buffer
(use-package highlight-thing
  :demand t
  :hook ((prog-mode . highlight-thing-mode)
         (org-mode . highlight-thing-mode))
  :config
  (setq highlight-thing-exclude-thing-under-point t
        highlight-thing-case-sensitive-p t
        highlight-thing-ignore-list
        '("False" "True", "return", "None", "if", "else", "self",
          "import", "from", "in", "def", "class")))

;; comment out to remove highlighting on line containing point
(global-hl-line-mode)

;; change frame title to buffer name
(setq frame-title-format
      '("emacs: " (:eval (if (buffer-file-name)
                             (abbreviate-file-name (buffer-file-name)) "%b"))))

;; enable line wrapping (otherwise will continue outside buffer)
(global-visual-line-mode 1)

;; lazy prompting
(fset 'yes-or-no-p 'y-or-n-p)

;; calendar settings
(setq-default
 european-calendar-style t
 calendar-date-style 'european
 calendar-week-start-day 1

 display-time-24hr-format t
 display-time-day-and-date t
 display-time-string-forms
 '((if (and (not display-time-format) display-time-day-and-date)
       (format-time-string "%a %b %e " now) "")
   (format-time-string (or display-time-format
                           (if display-time-24hr-format "%H:%M" "%-I:%M%p"))
                       now))
 calendar-time-display-form
 '(24-hours ":" minutes
            (if time-zone " (") time-zone (if time-zone ")"))
 )
(setq calendar-latitude 52.36547
      calendar-longitude 4.81926
      calendar-location-name "Amsterdam"
      calendar-time-zone 60)

;; misc. buffer settings
(winner-mode 1)   ;; undo/redo window configurations

(setq-default
 ;; debug setting
 debug-on-error nil

 ;; structure settings
 fill-column 100
 message-log-max 2000

 sentence-end-double-space nil
 indicate-empty-lines t

 ;; backup settings
 delete-old-versions t
 kept-new-versions 6
 kept-old-versions 2
 version-control t
 vc-make-backup-files t
 backup-directory-alist '((".*" . "~/.emacs.d/emacs-backups"))

 ;; ediff settings
 ediff-split-window-function 'split-window-horizontally
 ediff-window-setup-function 'ediff-setup-windows-plain

 ;; ibuffer settings
 ibuffer-use-other-window t
 ibuffer-formats
 '((mark modified read-only locked
         " " (name 36 36 :left :elide)
         " " (size 9 -1 :right)
         " " (mode 16 16 :left :elide) " " filename-and-process)
   (mark " " (name 16 -1) " " filename))

 async-shell-command-buffer 'new-buffer
 display-buffer-alist '(("*Async Shell Command*" . (display-buffer-no-window)))
 ibuffer-maybe-show-predicates
 `(,(lambda (buf)
      (or (and (string-match "^ " (buffer-name buf))
               (null buffer-file-name))
          (string-match ".*Async Shell Command.*" (buffer-name buf)))))

 ;; auto-complete settings
 read-buffer-completion-ignore-case t
 read-file-name-completion-ignore-case t
 )

;; prevent storage of sudo passwords in plaintext
(setq-default
 auth-sources '("~/.emacs.0/.authinfo.gpg")
 auth-source-save-behavior nil
 )

;; man page settings
(setq-default
 Man-width 100
 Man-notify-method 'pushy
 )

;; alternative to built-in Emacs help
(use-package helpful
  :bind (("C-h j" . helpful-at-point)
         ("C-h f" . helpful-callable)
         ("C-h v" . helpful-variable)
         ("C-h k" . helpful-key)
         ("C-c C-d" . helpful-at-point)
         ("C-h F" . helpful-function)))

;; paste at point, not location of mouse cursor
(setq-default mouse-yank-at-point t)

;; connect to server
(defun connect-server (server env)
  "Connect (via ssh/TRAMP) to SERVER and use the ENV python virtualenv.
This sets your default directory to live on SERVER. Call `M-x local` to move
back to the local machine. Note: if you don't use ssh host abbreviations, you
can also use ie. user@sevap.ru as SERVER."
  (interactive "sServer:
sVirtualenv (name of directory inside ~/.virtualenvs):")
  (setq default-directory (concat "/ssh:" server ":")
        shell-file-name "/bin/bash"
        python-shell-virtualenv-root (concat "~/.virtualenvs/" env)))

;; create default directory
(defun local ()
  "Set default directory back to local, remove (potentially remote) virtualenv."
  (interactive)
  (setq default-directory "~/"
        python-shell-virtualenv-root nil))

;; variable contains list of servers used
(defvar personal-hosts '("tete", "titty"))

;; tramp
(eval-after-load "tramp"
  `(setq tramp-default-method "ssh"
         password-cache-expiry nil
         remote-file-name-inhibit-cache nil
         tramp-completion-reread-directory-timeout nil
         tramp-use-ssh-controlmaster-options nil
         tramp-ssh-controlmaster-options
         (concat "-o ControlPath=~/.ssh/control/%%r@%%h:%%p "
                 "-o ControlMaster=auto "
                 "-o ControlPersist=yes ")))

(require 'tramp)

;; set language environment
(set-language-environment "UTF-8")
(setq uniquify-buffer-name-style 'forward
      locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(when (display-graphic-p)
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))

;; auto-revert reloaded images
(auto-image-file-mode 1)
(add-hook 'image-mode-hook 'auto-revert-mode)

;; allows for use of emacsclient
(require 'server)
(unless (server-running-p)
  (server-start))
