configuration.org
***  Auto-complete
Is it stated somnewhere:

CompletionUI use tooltip as completion UI, AutoComplete and CompanyMode implement by *Overlay*.

Tooltip just can use in X, and overlay can use both X and console.

Tooltip is slower than *overlay* when finger is very fast. 😊

But overlay have align render bug with multi-byte language (such as CJK), and tooltip haven’t
this problem.

About different between AutoComplete and CompanyMode, in fact they’re very similar, but
CompanyMode have more bug. – AndyStewart

But in Emacs30.1 there is =completion-preview-mode= is being added, so there is no need to do it
anywhere else.

#+begin_src emacs-lisp
  (setf completion-styles '(basic flex)
              completion-auto-select t ;; Show completion on first call
              completion-auto-help 'visible ;; Display *Completions* upon first request
              completions-sort 'historical ;; Order based on minibuffer history
              completions-max-height 20 ;; Limit completions to 15 (completions start at line 5)
              completion-ignore-case t)

  (completion-preview-mode)
#+end_src

*** Vertico

The [[https:https://github.com/minad/vertico][vertico]] package provides a streamlined interface for minibuffer
completions. Vertico is based on the default Emacs completion system, which
enables all existing completion commands in Emacs to use Vertico's UI with no
extra configuration (credit: [[https://www.youtube.com/watch?v=J0OaRy85MOo][System Crafters]]).

#+begin_src emacs-lisp
;; minibuffer completions
(savehist-mode 1) ;; save minibuffer history for vertico

(use-package vertico
  :demand t
  :init
  (vertico-mode))
#+end_src

*** Marginalia

The [[https://github.com/minad/marginalia][marginalia]] package was written by the same author of Vertico and adds
additional information to minibuffer completions (credit: [[https://www.youtube.com/watch?v=J0OaRy85MOo][System Crafters]]).

#+begin_src emacs-lisp
(use-package marginalia
  :demand t
  ;; either bind `marginalia-cycle` globally or only in the minibuffer
  :bind (("M-A" . marginalia-cycle)
         :map minibuffer-local-map
         ("M-A" . marginalia-cycle))
  ;; the :init configuration is always executed (Not lazy!)
  :init
  ;; must be in the :init section of use-package such that the mode gets
  ;; enabled right away. Note that this forces loading the package.
  (marginalia-mode))
#+end_src


*** Orderless

The [[https://github.com/oantolin/orderless][orderless]] package provides an orderless completion style using regexp. In
other words, you only have to type a component of the path/filename to return
the full name of the item you are looking for.

#+begin_src emacs-lisp
(use-package orderless
  :demand t
  :init
  ;; configure a custom style dispatcher (see the Consult wiki)
  ;; (setq orderless-style-dispatchers '(+orderless-dispatch)
  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))
#+end_src

** Spellchecking

Spell checking is important for both things like narratives and git commits.
The [[https://github.com/minad/jinx][jinx]] package is preferred over the builtin =flyspell= due to efficiency,
keybindings, and ability to save words to a dictionary.

The package uses the API of the =Enchant= library [[[https://abiword.github.io/enchant/][github/enchant]]] and only
analyses visible text (instead of the entire buffer). The =jinx= package
requires the following local packages to provide spell-checking. Both =enchant=
and =pkgconf= are Arch-specific. Dictionaries are provided by =nuspell= (the
modern version of =hunspell=). See [[https://github.com/minad/jinx][gitub/jinx]] for more details. In Arch,
packages can be download by ~yay enchant pkgconf hunspell~.

  + nunspell :: Spell-checker dictionaries
  + enchant :: Wrapper for spelling libraries
  + pkgconf :: Compiler; used by =jinx= to locate =enchant=
Useful commands include:
  + jinx-next / jinx-previous :: Jump to previous/next visible spelling error
  + jinx-correct-all :: Allow user to correct all spelling errors in buffer
nn
*QUIRK:* Comments in =src-blocks= are only checked if viewed in an
=org-edit-special= buffer accessed via ~C-c '~ . This is because =jinx= only
checks text possessing specific face properties (see ~jinx-include-faces~ and
~jinx-exclude-faces~). When coding, we are only interested in checking comments
and doc strings; ~tree-sitter-hl-face:comment~, for example extends this
functionality to =.py= files (see [[*Syntax Highlighting][Syntax Highlighting]]). To check a comment, we
would need to remove =org-block= in ~jinx-exclude-faces~ at the expense of
checking ALL of the code.

#+begin_src elisp
(use-package jinx
  :defer t
  :hook (org-mode text-mode prog-mode conf-mode)
  :bind (("C-c j c" . jinx-correct)
         ("C-c j a" . jinx-correct-all)
         ;; alias defined using 'jinx-correct' keybinding
         ("C-c j d" . jinx-save-word-at-point))
  :custom
  ;; 'jinx-mode' only checks text possessing specific face properties like
  ;; 'font-lock-comment-face' in 'prog-mode' for example.
  (jinx-include-faces
   '((yaml-mode . conf-mode)
     (yaml-ts-mode . conf-mode)
     ;; Only check docstrings and comments; not strings
     (conf-mode font-lock-comment-face)
     (prog-mode font-lock-comment-face
                font-lock-doc-face
                tree-sitter-hl-face:comment
                tree-sitter-hl-face:doc)))

  (jinx-languages "en_GB", "ru_RU")
  :config
  ;; Quickly save word-at-point to dictionary used by 'jinx'
  (defalias 'jinx-save-word-at-point (kmacro "C-c j c @ RET"))

  ;; 'jinx-correct' suggestions displayed as grid instead of long list
  (vertico-multiform-mode 1)
  (add-to-list 'vertico-multiform-categories
               '(jinx grid (vertico-grid-annotate . 20))))
#+end_src

#+RESULTS:
: jinx-save-word-at-point


** Writing
*** Smog
Smog package can be niceliy used for tex style analysing.
Check it with M-x smog-check

** Development
*** Git

Version (or source) control is the practice of tracking and managing changes to
software code. The [[https://magit.vc/][magit]] package is a powerful text-based user interface to
Git.

To learn the fundamentals of magit, please see the following links:
  + [[https://cbea.ms/git-commit/][Chris Beams]]: How to write a git commit? (article)
  + [[https://www.youtube.com/watch?v=_zfvQkJsYwI][SystemCrafters]]: Instruction to Magit Git interface (video)
  + [[https://www.youtube.com/watch?v=qPfJoeQCIvA][SystemCrafters]]: 9 Techniques to Boost Your Magit Workflow (video)

#+begin_src emacs-lisp
(use-package magit
  :defer t
  :bind ("C-x g" . magit-status)
  :diminish magit-minor-mode
  :hook ((git-commit-mode . (lambda () (setq fill-column 72)))
         (after-save . magit-after-save-refresh-status))
  :mode ("/\\.gitmodules\\'" . conf-mode)
  :custom
  (magit-diff-hide-trailing-cr-characters t)
  (git-commit-summary-max-length 50))
#+end_src

*** Projectile

The [[https://github.com/bbatsov/projectile][projectile]] package provides multiple features operating on a project-level.
This is a useful alternative to using built-in Emacs functionality ~C-x C-f~ to
find a specific file.

#+begin_src emacs-lisp
(use-package projectile
  :defer 2
  :config
  (projectile-mode +1)
  (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map))
#+end_src

** Org Keybindings

#+begin_src emacs-lisp
;; set load-path for submodules used at mlprograms
(let ((default-directory (expand-file-name "lisp" user-emacs-directory)))
  (unless (file-directory-p default-directory)
    (make-directory default-directory t))
  (add-to-list 'load-path default-directory)
  (normal-top-level-add-subdirs-to-load-path))

;; for org sourceblock insertion
(use-package org-block-extra
  :load-path "lisp"
  :bind (:map org-mode-map
              ("M-p" . org-previous-block)
              ("M-n" . org-next-block)
              ("M-P" . org-insert-block-above)
              ("M-N" . org-insert-block-below)
              ("M-D" . org-kill-block)
              ("M-W" . org-copy-block)
              ("C-c c" . org-execute-block-in-shell)
              ("C-c e" . org-execute-line-or-region-in-shell)
              ("C-c M-p" . org-babel-execute-above)
              ("C-c M-n" . org-babel-execute-below))
  :hook (before-save . (lambda ()
                         (when (eq major-mode 'org-mode)
                           (org-babel-remove-empty-results)))))
#+end_src


