configuration.el

(setf completion-styles '(basic flex)
            completion-auto-select t ;; Show completion on first call
            completion-auto-help 'visible ;; Display *Completions* upon first request
            completions-sort 'historical ;; Order based on minibuffer history
            completions-max-height 20 ;; Limit completions to 15 (completions start at line 5)
            completion-ignore-case t)

(completion-preview-mode)

;; minibuffer completions
(savehist-mode 1) ;; save minibuffer history for vertico

(use-package vertico
  :init
  (vertico-mode))

(use-package marginalia
  ;; either bind `marginalia-cycle` globally or only in the minibuffer
  :bind (("M-A" . marginalia-cycle)
         :map minibuffer-local-map
         ("M-A" . marginalia-cycle))
  ;; the :init configuration is always executed (Not lazy!)
  :init
  ;; must be in the :init section of use-package such that the mode gets
  ;; enabled right away. Note that this forces loading the package.
  (marginalia-mode))

(use-package orderless
  :init
  ;; configure a custom style dispatcher (see the Consult wiki)
  ;; (setq orderless-style-dispatchers '(+orderless-dispatch)
  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))

(use-package jinx
  :hook (org-mode text-mode prog-mode conf-mode)
  :bind (("C-c j c" . jinx-correct)
         ("C-c j a" . jinx-correct-all)
         ;; alias defined using 'jinx-correct' keybinding
         ("C-c j d" . jinx-save-word-at-point))
  :custom
  ;; 'jinx-mode' only checks text possessing specific face properties like
  ;; 'font-lock-comment-face' in 'prog-mode' for example.
  (jinx-include-faces
   '((yaml-mode . conf-mode)
     (yaml-ts-mode . conf-mode)
     ;; Only check docstrings and comments; not strings
     (conf-mode font-lock-comment-face)
     (prog-mode font-lock-comment-face
                font-lock-doc-face
                tree-sitter-hl-face:comment
                tree-sitter-hl-face:doc)))

  (jinx-languages "en_GB" "ru_RU")
  :config
  ;; Quickly save word-at-point to dictionary used by 'jinx'
  (defalias 'jinx-save-word-at-point (kmacro "C-c j c @ RET"))

  ;; 'jinx-correct' suggestions displayed as grid instead of long list
  (vertico-multiform-mode 1)
  (add-to-list 'vertico-multiform-categories
               '(jinx grid (vertico-grid-annotate . 20))))

(use-package magit
  :bind ("C-x g" . magit-status)
  :diminish magit-minor-mode
  :hook ((git-commit-mode . (lambda () (setq fill-column 72)))
         (after-save . magit-after-save-refresh-status))
  :mode ("/\\.gitmodules\\'" . conf-mode)
  :custom
  (magit-diff-hide-trailing-cr-characters t)
  (git-commit-summary-max-length 50))

(use-package projectile
  :config
  (projectile-mode +1)
  (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map))
